roeetal/enph253/Software/STM32/brain/Src/main.c
            }
            // todo delete below
            set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
            set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        }

        if (ewok_cnt == 4)
        {
            print("Fourth ewok captured\n", 0);
            turn_deg(150);
            set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
            set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
            open_claw(&htim3);
            while (HAL_GetTick() - timeee < 8000)
            {
                if (EDGE_LEFT_STATE == FLAGGED && EDGE_RIGHT_STATE == NOT_FLAGGED)
                {
                    set_motor_speed(TIM_CHANNEL_3, 0);
                    // Edge detected when LOW
                    while (HAL_GPIO_ReadPin(EDGE_LEFT_GPIO_Port, EDGE_LEFT_Pin) == GPIO_PIN_RESET);
                    HAL_Delay(200);
                    EDGE_LEFT_STATE = NOT_FLAGGED;
                    set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
                }
                if (EDGE_RIGHT_STATE == FLAGGED)
                {
                    set_motor_speed(TIM_CHANNEL_1, 0);
                    while (HAL_GPIO_ReadPin(EDGE_RIGHT_GPIO_Port, EDGE_RIGHT_Pin) == GPIO_PIN_RESET);
                    HAL_Delay(200);
                    EDGE_RIGHT_STATE = NOT_FLAGGED;
                    set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
                }
            }
            arm_down(&htim3);
        }

        if (ewok_cnt == 5)
        {
            print("Chewie captured\n", 0);
            turn_deg(50);
            open_claw(&htim3);
            HAL_Delay(750);
            arm_down(&htim3);
            slow_actuate(&htim3, BASKET_CH, 10, 180);
            drive_straight_time(enc_pid, LEFT_SPEED, RIGHT_SPEED, 3000);
            slow_actuate(&htim3, BASKET_CH, 180, 20);
        }
        CLAW_INT_STATE = NOT_FLAGGED;
        return TRUE;
}

// ******
// TESTS
// ******

/*
 * Instructions:
 *      Run test_All() before the main while loop
 *      - Put a pull up resistor on htim3 PWM waves, measure voltage on pin
 *      - Measure voltage on pin of htim1
 *      - Give ADC pins values and read off of screen
 */

/*
 * Test PWM
 * Output: htim1 channel 1 through 4, PWM wave. Confirm these
 *         PWM waves via an oscilliscope.
 */
void test_PWM_htim1()
{
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    // HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
    // HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
    int s = 0;
    while (s < 1000)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, s);
        // __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 500);
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, s);
        // __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 500);
        s += 100;
        HAL_Delay(1000);
    }
}

/*
 * Test PWM
 * Output: htim3 channel 1 through 3, PWM wave. Confirm these
 *         PWM waves via an oscilliscope.
 */
void test_PWM_htim3()
{
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);

    int s = 500;
    while (s < 2400)
    {
        __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, s);
        __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, s);
        __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, s);
        s += 100;
        HAL_Delay(500);
    }
}

void test_ADC()
{
    char msg[18] = "";
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));

    while (1)
    {
        int ch_5 = adc_values[0];
        int ch_4 = adc_values[1];

        sprintf(msg, "ch_5: %d\n", ch_5);
        print(msg, 0);

        sprintf(msg, "ch_4: %d\n", ch_4);
        print(msg, 2);

        HAL_Delay(100);
    }
}

/**
 * Test all PWM and ADC - Read PWM waves, input ADC voltages 
 * and read values on OLED
 *      htim1 -> CH1, CH2, CH3, CH4
 *      htim3 -> CH1, CH2, CH3
 *      ADC   -> CH5, CH4
 */
void test_All()
{
    test_PWM_htim1();
    test_PWM_htim3();
    test_ADC();
}
// ******
// END TESTS
// ******

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */
    while (1)
    {
    }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
